# Типы данных в питоне



# 1. NoneType - ничего, пустота -> NoneType
# 2. Boolean - истина или ложь -> True/False
# 3. Str() -  строки -> "hello world", 'My name is Bermet'
# 4. Числовые типы данных:
    # а) integer - int() - Целое число (-1, -2, 0, 1)
    # b) float() - число в плавающей точкой (-1.2, 10.15, 2.7)
    # c) complex() - Комплексные числа (3+5i6)
# 5. Списковые тип данных:
    # а) list (список/массив) -> {1,2,3,None,'Hello', True, False, {1,2,3]}
    # b) tuple (кортеж) -> (1,2,3,4, None)
    # c) range (последовательность) -> range (1,10)
# 6. set() -> Множества
# 7.  Dictinaty (словари) -> содержит данные в виде ключа и значения -> {1: 'One', 2: 'Two'}

# ****************************************

# Mutable (изменяемые типы данных)
#   1. list
#   2.set
#   3. dict

# Immitable (неизменяемые типы данных)
#   1. NoneType
#   2. boolean
#   3. int float complex
#   4. str
#   5. tuple
#    6. frozenset

'''Стандартный вывод данных'''
""""""
# В пайтоне для вывода данных в терминал используется встроенная функция print () 

# print ('Hello world! My name is Bermet')

# print(27+5)


# '''
# Стандартные ввод данных через терминал используется функция input()

# '''
# a = input('Введите число:')
# print ('В а хранится:')
# print (a)

# print(input('Введите своей имя:'))
